Netology/src/DataProcessors/ПересчетПоступлений/ПересчетПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПересчетПоступлений</name>
  <attributes>
    <name>ДатаНачалаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Netology/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Netology/src/DataProcessors/ПересчетПоступлений/Forms/Форма/Module.bsl
&НаСервере
Процедура ПересчитатьНаСервере()
	Выборка = Документы.ПоступлениеТоваровИУслуг.Выбрать(Объект.ДатаНачалаПериода,Объект.ДатаЗавершенияПериода);
	Пока Выборка.Следующий() Цикл
		Поступление = Выборка.ПолучитьОбъект();
		Для Каждого СтрокаТовары Из Поступление.Товары Цикл
			СтрокаТовары.Сумма = СтрокаТовары.Цена*СтрокаТовары.Количество;
		КонецЦикла;
		Если Поступление.Проведен Тогда
			Режим =РежимЗаписиДокумента.Проведение;
		Иначе
			Режим = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		Поступление.Записать(Режим);
	КонецЦикла;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	ПересчитатьНаСервере();
КонецПроцедуры
